app/controllers/v1/greetings_controller.rb

SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    render json: {
      greeting: Message.all.order('RANDOM()').first[:greetingmessage]