app/controllers/pages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @greeting = Message.all.order('RANDOM()').first[:greetingmessage]